{
    "header": {
        "me": "Matvey Zhigalka",
        "about": "About",
        "work": "Work"
    },
    "main": {
        "title": "Transforming Designs into Code. Full-Stack Web Developer.",
        "about": "I’m Matvey, a Front-End Developer specializing in React and TypeScript, based in Ukraine. With over 4 years of non-commercial experience and more than 6 months of commercial work, I excel at creating dynamic and engaging web experiences. My expertise includes crafting intuitive user interfaces, optimizing performance, and delivering high-quality code.",
        "touch": "Get in touch",
        "click": "(Click to copy)",
        "mail": "Email Copied",
        "more": "More about me",
        "projects": {
            "workradar": "European Job Search & Recruitment Platform",
            "british-hills": "English Language Learning School",
            "fc-lb": "Football Club Merchandise Store",
            "vadaleos": "Real Estate & Property Development Company",
            "bwt": "Vehicle Shipping & Transport Platform",
            "streamout": "Video Sharing & Creator Monetization Platform",
            "daiwo": "Hybrid Investment & Crypto Platform"
        }
    },
    "about": {
        "main": {
            "title": "Frontend Developer specializing in the creation of high-quality websites and innovative user interfaces.",
            "text1": "I'm Matvey, a Front-End Developer with a deep-rooted passion for web development that began in high school. My journey started in 10th grade, where I first explored front-end development through HTML and CSS. By 11th grade, I had a solid grasp of these technologies and decided to pursue Computer Engineering at Kharkiv National University of Radio Electronics.",
            "text2": "During my university studies, I delved into key programming principles, including OOP and algorithms, and took various courses that expanded my knowledge of front-end development. I became proficient in JavaScript and familiarized myself with Git and version control systems, ultimately choosing React JS for further specialization. Currently, I am enhancing my skills in TypeScript and Redux Toolkit.",
            "text3": "I've gained hands-on experience through an internship at HARBOUR TECH ABI CRM LTD, working on a CRM system project tailored for the Spanish market. Additionally, I am employed part-time at Artic Web, where I contribute to the development of diverse web applications for various clients. With over 6 months of commercial experience and approximately 4 years of non-commercial work, I am committed to creating innovative and effective web solutions that meet both user needs and business objectives."
        },
        "experience": {
            "title": "Work Experiences",
            "date1": "May 17, 2024 - October 23, 2024",
            "date2": "January 13, 2024 - February 19, 2024",
            "date3": "February 23, 2024 - April 29, 2024",
            "date4": "October 23, 2024 - Present",
            "role": "My Role: {{role}}",
            "role1": "At Artic Web, I played a key role in developing web applications of varying complexities, leveraging technologies such as React JS, Tailwind CSS, and Redux Toolkit. During this period, I not only honed my technical skills but also significantly improved my soft skills, including communication, problem-solving, and teamwork. Additionally, I solidified my expertise in React JS, confidently applying advanced concepts and best practices in real-world commercial projects.",
            "role2": "At HARBOUR TECH ABI CRM LTD, I contributed to the development of a CRM system tailored for the Spanish market, utilizing JavaScript, HTML, and SCSS, with the front-end seamlessly integrated into WordPress. This project also marked my first experience with the Husky commit system, which proved to be highly beneficial for collaborative work. I developed two key pages, which are showcased in my portfolio. This role provided me with invaluable experience, particularly through mentorship and interaction with more experienced developers, significantly shaping my growth as a front-end developer.",
            "role3": "After completing my internship at HARBOUR TECH ABI CRM LTD, I was offered a position as a Frontend Developer. In this role, I have worked on various projects, including my most recent one, which focused on delivering exceptional construction services with an emphasis on quality, safety, and sustainability. This project, built with Next.js, incorporated libraries such as Mapbox, i18n, and SCSS. You can view the project here: Garcia Global. My work on this project has allowed me to apply advanced technical skills while contributing to the growth and success of our clients."
        },
        "education": {
            "title": "Education",
            "course": "Course",
            "nure": "Kharkiv National University of Radio Electronics",
            "faculty": "Faculty of computer engineering and management, specialty - computer engineering",
            "certificate": "Certificate",
            "date1": "Sept. 2022 - Mar. 2024",
            "date2": "Sept. 2023 - Oct. 2023",
            "date3": "Nov. 2023 - Dec. 2023",
            "date4": "Jan. 2023 - Nov. 2023",
            "date5": "Feb. 2023 - Feb. 2023"
        },
        "skills": {
            "title": "Skills"
        },
        "contacts": {
            "title": "Contacts",
            "text": "Feel free to reach out for projects, collaborations, or just to say hello! Currently seeking new opportunities."
        }
    },
    "work": {
        "notLink": "Project in development"
    },
    "projects": {
        "website": "Website",
        "backToAllProjects": "Back to all project",
        "projectNotFound": "Project not found",
        "projectDescriptionError": "Project in development",

        "workradar": {
            "text": "Work Radar is a large-scale job search and recruitment platform focused on employment opportunities across Europe. The platform connects companies and recruiters with candidates, allowing businesses to publish job offers and services while candidates can explore vacancies, view locations on an interactive map, filter offers by distance and salary, and apply directly through the platform. Work Radar combines advanced geolocation features, flexible salary conversion, and strong SEO optimization to deliver a performant and user-friendly experience.",
            "myRole": "I was fully responsible for the design, architecture, and development of the Work Radar platform as a full-stack developer. I implemented the entire front-end based on the provided design and later developed the complete back-end from scratch. My responsibilities included building a role-based system with two main user types (recruiters and candidates), implementing a multi-step authentication and registration flow (email/password, Google OAuth, and LinkedIn OAuth), and developing secure role-based route protection.\n\nA significant part of my work focused on complex geolocation and map logic. I implemented an optimized interactive map with reusable markers, clustering overlapping points, and memoization to prevent unnecessary re-renders during filtering and searching. I also built logic for detecting user location via browser geolocation with fallback to IP-based location, persisting location data locally and synchronizing it with the database.\n\nI designed and implemented advanced filtering and search logic based on user radius, geolocation, salary ranges, and multiple criteria, including infinite scrolling with lazy loading to avoid traditional pagination. Salary and currency conversion logic was built from scratch, supporting numeric ranges, string-based values, multiple currencies, cached exchange rates, and graceful fallbacks.\n\nOn the content side, I implemented rich text editing for job offers and services using Quill, preserving original HTML structure for correct rendering and SEO. I also developed a custom SSR-based SEO solution on the back-end to ensure proper meta tags, images, and previews when sharing job offers or services.\n\nAdditionally, I built a full-featured admin panel that allows administrators to manage users, offers, services, and applications, including activation, deactivation, deletion, and content moderation. Admins can export user data to Excel, manage platform content, and monitor activity. I also implemented scheduled tasks using cron jobs to automatically remove expired job offers.\n\nOverall, I designed the entire system architecture, coordinated technical decisions with the technical director, optimized performance across the application, and delivered the project fully on time. Work Radar is one of my most complex and complete projects, combining front-end, back-end, optimization, SEO, and advanced business logic into a single scalable platform.",
            "description": "Technologies Used:",
            "descriptionText": [
                "ReactJS & TypeScript: Used to build a scalable, strongly typed front-end architecture with clear separation of concerns.",
                "Redux Toolkit: Implemented for global state management, including authentication, filters, listings, map data, and admin logic.",
                "Vite: Served as the development and build tool for fast iteration and optimized production builds.",
                "TailwindCSS: Applied for responsive layouts, consistent styling, and adaptive UI across all screen sizes.",
                "MapLibre GL: Used to implement an interactive, optimized map with clustered markers and memoized rendering.",
                "i18next & React i18next: Implemented multilingual support with dynamic language detection and static content translation.",
                "Quill Editor: Integrated for rich text editing of job offers and services while preserving original HTML for correct rendering.",
                "Node.js & Express: Used to build a scalable back-end API handling authentication, business logic, SEO rendering, and admin features.",
                "MongoDB & Mongoose: Implemented as the primary database for users, offers, services, applications, and location data.",
                "JWT, Google OAuth & LinkedIn OAuth: Used for secure authentication and role-based authorization.",
                "Cloudinary & AWS S3: Implemented for media uploads, galleries, and asset storage.",
                "Node Cron: Used for scheduled tasks such as automatic expiration and removal of outdated job offers.",
                "ExcelJS: Integrated into the admin panel to export user and platform data in Excel format.",
                "React Helmet Async: Used for client-side SEO management and dynamic meta tags.",
                "Intersection Observer & Lazy Loading: Implemented infinite scrolling and optimized data loading to reduce API overhead."
            ]
        },
        "british-hills": {
            "text": "British Hills is an interactive multi-page web platform for an English language school, designed to attract and onboard new students. The website allows users to submit enrollment requests and complete an interactive English level test, with results and contact details sent directly to administrators for further processing. The platform focuses on engagement, accessibility, and a visually rich user experience.",
            "myRole": "I was fully responsible for the front-end development of the British Hills platform, implementing the complete user interface based on the provided design. My role included building a highly interactive and animation-driven website using modern front-end technologies. I designed and implemented animated sections, headings, and transitions, ensuring smooth interactions across all pages. I also developed the interactive English level test with result calculation and integrated EmailJS to send test results and enrollment requests both to the user and the admin. Additionally, I worked extensively on responsive design and performance optimization, including disabling heavy animations on mobile devices to improve loading speed and Lighthouse performance scores.",
            "description": "Technologies Used:",
            "descriptionText": [
                "ReactJS & TypeScript: Used to build a structured, maintainable, and scalable front-end application.",
                "Vite: Served as the development and build tool for fast iteration and optimized production builds.",
                "TailwindCSS: Applied for responsive layouts and consistent styling across all sections.",
                "Framer Motion: Used extensively to implement animations, transitions, and interactive UI elements.",
                "React Router DOM: Enabled smooth navigation across multiple pages and sections.",
                "EmailJS: Integrated to handle enrollment forms and test result submissions via email.",
                "React Slick & Slick Carousel: Implemented complex carousels and sliders for content presentation.",
                "React Beautiful DnD & React Draggable: Used to create interactive drag-and-drop and draggable UI elements.",
                "React Confetti: Added celebratory visual effects to enhance user engagement.",
                "React Helmet Async: Used for SEO optimization and dynamic metadata management.",
                "React Hot Toast: Provided user feedback through notifications and alerts."
            ]
        },
        "fc-livyi-bereh": {
            "text": "FC LB is an official fan shop web application for the Kyiv-based football club Levyi Bereg. The platform is designed to sell club merchandise, accessories, and apparel while also serving as an informational hub for fans. The application provides a modern shopping experience with a clean interface, responsive design, and seamless navigation across all sections.",
            "myRole": "I was the lead and sole front-end developer on the FC LB fan shop project, fully responsible for implementing the entire client-side of the application. My work included translating the provided design into a functional React application, building all user-facing pages as well as the admin panel interface, and ensuring consistent styling and responsive behavior across devices. I collaborated closely with the back-end developer to integrate product data, categories, and database-driven content. My responsibilities covered layout implementation, state management, form handling, validation, and overall UI/UX polish, with a strong focus on adaptability, maintainability, and performance.",
            "description": "Technologies Used:",
            "descriptionText": [
                "ReactJS & TypeScript: Used to build a scalable and maintainable front-end architecture with strong type safety.",
                "Vite: Served as the development and build tool, ensuring fast reloads and optimized production builds.",
                "Redux Toolkit: Implemented for global state management, including user sessions, products, and admin data.",
                "React Router DOM: Used to manage application routing and navigation between public pages and the admin panel.",
                "TailwindCSS: Applied for responsive and consistent styling across all layouts and components.",
                "React Hook Form & Zod: Used to build and validate complex forms for authentication, product management, and admin workflows.",
                "Axios: Integrated for communication with the back-end API and data fetching.",
                "Google OAuth & JWT: Used for user authentication and session handling on the client side.",
                "React Slick & Slick Carousel: Implemented for product sliders and promotional sections.",
                "React Content Loader: Added skeleton loaders to improve perceived performance during data loading.",
                "React Helmet Async: Used for SEO optimization and dynamic metadata management.",
                "React Hot Toast: Provided real-time feedback for user actions such as form submissions and errors."
            ]
        },
        "vadaleos": {
            "text": "Vadaleos is a professional real estate platform based in Prague, Czech Republic, designed for a company specializing in turnkey apartment sales. The website showcases high-quality renovated properties ready for immediate move-in, allowing clients to explore different design options and interior finishes according to their preferences. The platform provides an intuitive multi-page experience, optimized performance, and a modern visual style that reflects the brand’s premium positioning.",
            "myRole": "I was fully responsible for developing the front-end architecture of Vadaleos from the ground up — from initial setup to final deployment. My work included designing a scalable structure for the React application, implementing multilingual support with i18next for Czech and English languages, and ensuring strong SEO optimization and performance across all pages. I integrated complex form logic using EmailJS for lead submissions, built custom sliders with React Slick, and implemented smooth animations with Framer Motion for an engaging user experience. Additionally, I focused on seamless collaboration with the senior back-end developer to ensure stable API integration and overall system reliability. The result was a fast, polished, and production-ready website that met all client expectations and was successfully delivered on time.",
            "description": "Technologies Used:",
            "descriptionText": [
                "ReactJS & TypeScript: The foundation of the front-end, providing a modular, maintainable, and performant architecture.",
                "Vite: Used as the development and build environment for fast bundling and optimized deployment.",
                "TailwindCSS: Employed for efficient and responsive styling, ensuring a clean and consistent UI across devices.",
                "Framer Motion: Added smooth transitions and micro-animations to elevate the overall user experience.",
                "i18next & React i18next: Implemented full multilingual support for Czech and English, including dynamic language detection and content management.",
                "EmailJS: Integrated for form submission handling, allowing leads and client inquiries to be sent directly via email.",
                "React Slick & Slick Carousel: Used for property sliders and interactive image galleries.",
                "React Helmet Async: Ensured proper SEO configuration and dynamic metadata across all pages.",
                "React Hot Toast: Added user-friendly notifications and feedback for form interactions and system actions.",
                "React Router DOM: Enabled smooth navigation between multiple pages, maintaining a consistent and fast user experience."
            ]
        },
        "bwt-group-logistics": {
            "text": "BWT Group Logistics is a modern multi-page website designed to present a logistics and transportation company with a focus on professionalism and user convenience. The platform combines clear structure, responsive design, and smooth animations to create a dynamic and visually engaging experience for visitors.",
            "myRole": "I was fully responsible for the development of the BWT Group Logistics website from scratch — starting with layout creation, interface design, and implementation of all functionality. The entire UI/UX design was developed by me without pre-existing mockups, based solely on provided content and page structure. I implemented a complex multi-step lead form with dynamic validation and integrated it with EmailJS to send submissions directly via email for lead processing. I also worked on responsive layouts, SEO optimization, and added animated transitions using Framer Motion to make the site more interactive and professional.",
            "description": "Technologies Used:",
            "descriptionText": [
                "ReactJS & TypeScript: Core technologies used to build a scalable and maintainable front-end with a component-based architecture.",
                "Vite: Utilized as the development environment and build tool for fast and optimized project bundling.",
                "TailwindCSS: Applied for building responsive layouts quickly and maintaining a clean, consistent design system.",
                "Framer Motion: Used to implement animations and page transitions for a more engaging and modern user experience.",
                "React Router DOM: Handles navigation across multiple pages, ensuring smooth routing and a seamless browsing flow.",
                "React Slick & Slick Carousel: Implemented for sliders and carousels, enhancing the visual presentation of services and testimonials.",
                "EmailJS: Integrated for sending form data directly to email, enabling efficient lead capture and communication.",
                "React Helmet Async: Used for SEO optimization and dynamic metadata management.",
                "React Hot Toast: Provides real-time visual feedback for form submissions and user actions.",
                "React GTM Module: Integrated Google Tag Manager for analytics and tracking user behavior to improve marketing insights."
            ]
        },
        "streamout": {
            "text": "StreamOut is a full-featured video streaming and monetization platform designed for content creators and viewers. The platform allows creators to publish videos, receive financial support from viewers, and manage earnings through integrated payment systems. StreamOut is built as a scalable multi-role system with a strong focus on security, financial transparency, and flexible monetization logic.",
            "myRole": "I joined the StreamOut project primarily as a back-end developer and later worked as a full-stack engineer, responsible for designing and implementing core platform logic. I developed the complete authentication and authorization flow, including email/password authentication and Google OAuth integration. I built the back-end architecture from scratch, created database models, and implemented full user profile management — including profile editing, password changes, notifications, settings, and account deletion.\n\nAfter completing the authentication and profile flows, I designed and implemented the financial architecture of the platform. This included building a flexible commission system for creators and viewers, supporting multiple commission models (platform-based and referral-based), and implementing creator profit calculations. I integrated Stripe Connect (Express) for payments and payouts, handling platform fees, Stripe fees, multi-role transactions, and webhook-based transaction status updates. I also worked on PayPal payment logic without user redirection, implementing internal balance tracking and commission calculations.\n\nI designed the complete payout flow for creators, including monthly withdrawals, platform commission handling, and centralized admin balance management. Additionally, I implemented referral tracking logic using URL parameters, flexible commission configuration via environment variables, and ensured all financial operations were securely stored and reflected in user profiles. The project is still under development, and my work focused on delivering a solid, scalable foundation for authentication, payments, and monetization.",
            "description": "Technologies Used:",
            "descriptionText": [
                "ReactJS & TypeScript: Used on the front-end to build a scalable, strongly typed, and maintainable user interface.",
                "Redux Toolkit: Implemented for predictable global state management across authentication, user profiles, and payments.",
                "Vite: Served as the build and development tool for fast iteration and optimized production builds.",
                "TailwindCSS & Headless UI: Used to create accessible, responsive, and clean UI components.",
                "Framer Motion: Added smooth animations and transitions to enhance user experience.",
                "i18next & React i18next: Implemented multilingual support with language detection and dynamic content loading.",
                "React Hook Form & Yup: Used to build complex forms with validation for authentication, settings, and profile management.",
                "Node.js & Express: Formed the foundation of the back-end API, handling authentication, payments, and business logic.",
                "MongoDB & Mongoose: Used for data modeling and storage of users, transactions, payouts, and platform settings.",
                "JWT & Google OAuth: Implemented secure authentication using JSON Web Tokens and Google OAuth provider.",
                "Stripe Connect (Express): Integrated for payments, platform fees, creator payouts, commission handling, and webhook-based transaction tracking.",
                "PayPal SDK: Implemented direct payment and payout logic without redirection, including commission and balance calculations.",
                "AWS S3 & Cloudinary: Used for secure media storage and asset handling.",
                "Node Cron: Implemented scheduled tasks for payouts, balance updates, and platform maintenance logic.",
                "EmailJS, Nodemailer & Mailgun: Used for transactional emails, notifications, and system messages."
            ]
        },
        "daiwo": {
            "text": "DAIWO is an advanced web platform centered around cryptocurrency and digital investments. It provides an immersive 3D experience, interactive trading features, and informative sections such as the About and Investment pages. The project combines modern UI design with blockchain integration to deliver a professional and engaging user experience.",
            "myRole": "My role in the DAIWO project involved optimizing performance and refactoring existing components to improve efficiency and maintainability. I was responsible for redesigning several core pages, including the About and Buy/Sell, enhancing their layout and adding smooth animations for a more dynamic feel. Additionally, I implemented the full logic for the Investment System page — including staking mechanics, percentage calculations, wallet connection integration, and interactive state management with accordions and user actions. Overall, my focus was on improving usability, interactivity, and code performance across the platform.",
            "description": "Technologies Used:",
            "descriptionText": [
                "ReactJS & TypeScript: The core of the application is built with ReactJS for building dynamic interfaces and TypeScript for ensuring type safety and maintainability.",
                "Vite: Used as the development and build tool, providing fast bundling and optimized production builds.",
                "TailwindCSS & SCSS: Styling is implemented with TailwindCSS for utility-first design and SCSS for custom components, ensuring flexibility and modern aesthetics.",
                "Three.js & React Three Fiber: Enables interactive 3D visuals, enhancing user engagement with immersive WebGL graphics.",
                "@tanstack/react-query: Handles data fetching and caching efficiently, ensuring smooth updates and real-time data synchronization.",
                "Framer Motion & Animate.css: Used to create smooth, visually appealing animations that improve user experience and add depth to the design.",
                "Axios: Used for API communication, enabling secure and efficient interaction with external data sources.",
                "Wagmi, Ethers.js & Web3: Integrated to support blockchain functionality, wallet connections, and crypto transactions.",
                "EmailJS & React Hot Toast: Used for handling contact forms and user notifications with modern and responsive feedback.",
                "Optimization & Code Splitting: Performance improvements were achieved by refactoring components, lazy-loading heavy elements, and compressing assets for faster loading."
            ]
        }
    }
}
